PKS1C/src/Reports/ГрафикРаботОбщий/ГрафикРаботОбщий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ГрафикРаботОбщий</name>
</mdclass:Report>

PKS1C/src/InformationRegisters/ПочасовыеРаботы/ПочасовыеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочасовыеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Удаленка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Reports/ГрафикРаботОбщий/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура МесяцНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Месяц = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2"); 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформирватьНаСервере(Месяц, Диаграмма)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(ПочасовыеРаботы.Регистратор.Дата, ДЕНЬ) КАК Дата,
		|	ПочасовыеРаботы.Исполнитель КАК Исполнитель,
		|	ПРЕДСТАВЛЕНИЕ(ПочасовыеРаботы.Исполнитель) КАК ИсполнительПредставление,
		|	ПочасовыеРаботы.ВремяЗатраты КАК ВремяЗатраты
		|ИЗ
		|	РегистрСведений.ПочасовыеРаботы КАК ПочасовыеРаботы
		|ГДЕ
		|	ПочасовыеРаботы.Регистратор.Дата МЕЖДУ &От И &До
		|ИТОГИ
		|	СУММА(ВремяЗатраты)
		|ПО
		|	Исполнитель,
		|	Дата";
	
	От = КонецДня(Месяц);
	До = КонецМесяца(Месяц);
	
	Запрос.УстановитьПараметр("До", КонецМесяца(Месяц));
	Запрос.УстановитьПараметр("От", Месяц);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.АвтоТранспонирование = Ложь;
	
	ВыборкаИсполнитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИсполнитель.Количество() = 0 Тогда
		Сообщить("В этом месяце работ не было");
	КонецЕсли;
	
	Пока ВыборкаИсполнитель.Следующий() Цикл		
		Дата = От;
		Серия = Диаграмма.УстановитьСерию(ВыборкаИсполнитель.Исполнитель);
		Серия.Текст = ВыборкаИсполнитель.ИсполнительПредставление;
		Серия.Расшифровка = ВыборкаИсполнитель.Исполнитель;
	
		ВыборкаДата = ВыборкаИсполнитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаДата.Следующий();
		
		Пока Дата <= До Цикл			
			Если Не Дата = ВыборкаДата.Дата Тогда
				Точка = Диаграмма.УстановитьТочку(Формат(Дата, "ДФ=""дд.ММ.гггг"""));
				Точка.Текст = Формат(Дата, "ДФ=""дд.ММ.гггг""");
				Точка.Расшифровка = Формат(Дата, "ДФ=""дд.ММ.гггг""");
				Диаграмма.УстановитьЗначение(Точка, Серия, 0);
			ИначеЕсли Дата = ВыборкаДата.Дата Тогда	
				Точка = Диаграмма.УстановитьТочку(Формат(Дата, "ДФ=""дд.ММ.гггг"""));
				Точка.Текст = Формат(Дата, "ДФ=""дд.ММ.гггг""");
				Точка.Расшифровка = Формат(Дата, "ДФ=""дд.ММ.гггг""");
				Диаграмма.УстановитьЗначение(Точка, Серия, ВыборкаДата.ВремяЗатраты);
				ВыборкаДата.Следующий();
			КонецЕсли;
			Дата = Дата + 86400;
		КонецЦикла;
	КонецЦикла;
	
	Диаграмма.АвтоТранспонирование = Истина;
	Диаграмма.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформирвать(Команда)
	СформирватьНаСервере(ЭтаФорма.Месяц, ЭтаФорма.График);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
КонецПроцедуры
